"use client";

import { useEffect, useState } from "react";
import styles from "./LovePage.module.css";

const START_DATE = new Date("2025-11-05T20:30:00");

type Time = {
  days: number;
  hours: number;
  minutes: number;
  seconds: number;
};

function calculateTimeTogether(): Time {
  const now = new Date();
  const diff = Math.max(now.getTime() - START_DATE.getTime(), 0);

  return {
    days: Math.floor(diff / (1000 * 60 * 60 * 24)),
    hours: Math.floor((diff / (1000 * 60 * 60)) % 24),
    minutes: Math.floor((diff / (1000 * 60)) % 60),
    seconds: Math.floor((diff / 1000) % 60),
  };
}

export default function LovePage() {
  const [open, setOpen] = useState(false);
  const [showVideo, setShowVideo] = useState(false);
  const [time, setTime] = useState<Time>(calculateTimeTogether());

  const photos = [
    { src: "pirvelikvavili.jpeg", caption: "პირველი ყვავილი.დაბადების დღე თან ყვავილები არ მიყვარს თან თვალით არ მყავს ნანახი ადამიანი ისე ვუგზავნი 😄" },
    { src: "firstdate.png", caption: "დღე, როცა დრო გაჩერდა ⏳ 05.11.2025 პირველი შეხვედრა" },
    { src: "pirveliphoto.jpeg", caption: "პირველი ფოტო.მოუმზადებელი იყო 🥰 სარკეც რას გავს 😄" },
    { src: "meorekvavili.jpeg", caption: "პირველ ყვავილებზე არ მქონდა იმის ბედნიერება რომ ფოტო გამოეგზავნა პირადად ჩემთვის აქ უკვე მეორე ყვავილებია და ურთიერთობაც ბევრად წინაა წასული" },
    { src: "qolga.jpeg", caption: "პირველი მოულოდნელობა,ვურეკავ სად ხართქო ამ წამს ამოვედი სახლიო და მეთქი ჩამოიხედე აბა.ძაან ესიამოვნა მაგრამ სულ ცოტახნით ჩამოვიდა.თან გაწვიმდა და ქოლგა ჩამომიგდო,რომელიც ახლაც სახლში მაქვს 😄" },
    { src: "mesamekvavili.jpeg", caption: "აქ წინა დღეს გავაბრაზე და კოჭლმა მოვუტანე ყვავილები. მანამდე თუ არაფერზე ბრაზდებოდა აქ უკვე დაწყებული ქონდა რაღაცეებზე დარდი 😄" },
    { src: "", caption: "22.09.2025 დღე როდესაც ჩვენს ურთიერთბაში ალბათ ყველაზე დიდი გარდატეხა მოხდა,როცა მართვის მოწმობის გამოცდის ჩასაბარებლად წასულ ნინის ზუგდიდში დავადექი.მიზეზი?უბრალოდ რა შედეგითაც არ უნდა დასრულებულიყო ეგ გამოცდა იქ მინდოდა ვყოფილიყავი ვერ გავჩერდი სიცხიანი ვიყავი,მაგრამ პირობა მქონდა მიცემული რომ თვითონ როგორც უნდოდა ისე იქნებოდა ყველაფერი.უკან ერთად წამოვედით მაშინ ეზიარა ჩემს იუმორს სიღრმისეულად 😄 ყველაზე არაკომფორტული მგზავრობა თუ ასე ძალიან მესიამოვნებოდა არმეგონა და არ მინდოდა დასრულებულიყო პირველად ჩემს ცხოვრებაში 😄 ამ დღეს ფოტო არ გადაგვიღია სამწუხაროდ" }, 
    { src: "keria.jpeg", caption: "დღე, როდესაც ოფიციალურად სახლში შევუვარდი და ნახა რომ ცოტა ვერ ვარ 😄 თამუნას და ნუკის ორიგინალურად გაცნობის დღე მანამდე მხოლოდ ერთხელ მყავდნენ ნანახი გასაღები მივაწოდეთ 😄 დღე კი ცუდად დაიწყო მაგრამ როგორც შეგვეფერებოდა ისე დავასრულეთ 🥰" },
    { src: "filmi.jpeg", caption: "აქ ფილმის სანახავედ წავედი,ვითომ მე ძაან მაინტერესებდა 😄 ნახევარი საათი რეკლამა გვეგონა თურმე დაწყებული ყოფილა სესია 😄" },
    { src: "", caption: "29.12.2025 თარიღი პირველად როცა ნინი ვერ გავითვალისწინე დღე როდესაც გადავთვერი და არ მოვიქეცი ისე როგორც მე მეკადრებოდა პირველ რიგში(სახლში მივადექი ნასვამი).თითქმის ყველას დაეკარგა ჩემზე წარმოდგენა,მაგრამ გადავრჩი..." }, 
    { src: "axaliweli.jpeg", caption: "01.01.2026 თარიღი როდესაც ცხოვრებაში პირველად ოჯახის წევრების გარეშე შევხვდი ახალ წელს.თან წინა დღეებში გავაბრაზე მეგონა რომ მხოლოდ ქვემოთ ჩამოსვლით შემოიფარგლებოდა მაგრამ არა გამიმართლა და ერთად შევხვდით ამ დღეს ყველაზე ბედნიერი წლის დასაწყისი იყო ჩემთვის 🥰 თან თიკოც გავიცანი.მოკლედ იდეალურადაა ყველაფერი იმის კვალობაზე რომ ჯერ ორი თვეც არაა გასული...🥰ამ დღეს მგონი ყველას გახარება შევძელი სურვილი სულ ერთი მაქვს ნინი და ყველა ნინის ირგვლივ..." }, 
    { src: "mcxeta.jpeg", caption: "ეს მცხეთაა უბრალოდ იმას ვცდილობ რომ მხოლოდ ნინი არ იყოს ჩემით გახარებული არამედ ყველა მის ირგვლივ,თან თიკო იყო გასასეირნებელი თორე ამათ იმედად მარტო კლინიკაში ყავდათ 😄" }, 
    { src: "", caption: "მერე იყო 5 , 6 , 7 შობასაც ერთად შევხვდით სანთელიც ავანთეთ რაღაცეები ჩავიფიქრეთ მე ნინი ჩავიფიქრე თვითონ არვიცი...🥰" }, 
    { src: "gamochena.jpeg", caption: "ისე დავიხვეწეთ უკვე ყვავილებთან ფოტოში მეც გამოვჩნდი...😄🥰" }, 
    { src: "dgeebi.jpeg", caption: "მერე მივაყოლეთ დღეები ყოველდღე ერთად ვიყავით სამსახურიდან გამოსულზე პირდაპირ იქ გავრბოდი რომ რაც შეიძლება მალე მენახა მომესმინა და ჩავხუტებოდი...🥰" }, 
    { src: "ertad.jpeg", caption: "წავედით ბაკურიანში.პირველი გასვლა ქალაქიდან.პირველი ერთად დასვენება.მაშინ გავიაზრე თურმე რა რეალური ყოფილა წინადადება 'რა ახლოს ხარ და მაინც რა შორს'...😄🥰" }, 
    { src: "sabagiro.jpeg", caption: "როგორც ახალი წლის შემოსვლა და მასზე მოყოლებული სხვა დღეები იყო განსაკუთრებული ჩემთვის ისე იყო ეს დასვენებაც,როგორც მგზავრობას ვერ ვიტან მაგრამ ყველაზე გემრიელად ვიმგზავრე ისე თოვლს ვერ ვიტან მაგრამ ერთერთი ყველაზე ბედნიერი 3 დღე მქონდა ცხოვრებაში...🥰" }, 
    { src: "tbili.jpeg", caption: "ყველაზე თბილი 🥰" }, 
    { src: "", caption: "18.01.2026 პირველად ურთიერთობაში რომ მე ნინისგან რამე მეწყინა თან მძიმედ მეწყინა უბრალოდ არ შევიმჩნიე.ჩემში ვიღაცამ ეჭვი გაუჩინა მაგრამ არ დაიჯერა არ დაიჯერაზე მეტად უფრო ის იყო რომ მაინც შიგნიდან აწუხებდა ეს ფაქტი..." }, 
    { src: "", caption: "დავბრუნდით თბილისში და უარესობისკენ დაიწყო ყველაფერმა სვლა..." }, 
    { src: "", caption: "მოკლედ დღეს 5 თებერვალია დღე როდესაც 3 თვე შეუსრულდა ჩვენს ურთიერთობას მაგრამ ერთად არ ვართ ერთმა საბედისწერო შეცდომამ ამ ზომამდე მომიყვანა მე გავაფუჭე ყველაფერი კი შევეწინააღმდეგე ისე დავიჭირე თავი თითქოს დამნაშავე თვითონ ყოფილიყო მაგრამ რეალურად მიზეზი ამ ნაბიჯების ის არის რომ იმაზე საუბარს რომ ნინი ყველაფერში მართალი ხარ უფრო დიდი დისტანცია არ გაეჩინა ჩვენს შორის უბრალოდ დრო მივეცი ახლა რომ მეტი იფიქროს და ყველაფერი გაანალიზოს თვითონ თუ იმას ფიქრობს რომ ამ დღეებში გაქრობით მე დავნებდი ძალიან ცდება მაშინ თურმე მართლა ვერ გაუგია ვინ ვარ და რა მინდა.იმ დღეს უბრალოდ ერთი წამითაც თავში აზრად არ დამიშვია რომ ყვავილების მოტანას შეიძლებოდა ამ დონემდე მოვეყვანეთ ანუ ვერც კი ვიფიქრე რომ ეს საქციელი ნინის არ გათვალისწინებად დამიჯდებოდა ასეთი რამე გულში არ მქონია საერთოდ მე უბრალოდ გახარება მინდოდა ჩემი ადამიანის...დანარჩენზე საუბარი შემიძლია მინდა რომ გულწრფელად ავხსნა ყველაფერი იმედია მომეცემა ამის შესაძლებლობა...🥰" }, 
    { src: "", caption: "შენიშვნა: ბევრი ისეთი მომენტი იყო ყოველი დღე განსაკუთრებული იყო რაც ერთად გაგვიტარებია მაგრამ ყველაფერზე საუბარს ვერ ვახერხებ.ერთი და მნიშვნელოვანი რაც არის ის არის რომ ამ ადამიანთან ჩემს თავს ვემსგავსები ამ ადამიანთან ვიცი ვინც უნდა ვიყო...🥰 " }, 
 
  ];

  useEffect(() => {
    const interval = setInterval(() => {
      setTime(calculateTimeTogether());
    }, 1000);
    return () => clearInterval(interval);
  }, []);

  return (
    <main className={styles.container}>
      <section className={styles.card}>
        {/* floating hearts */}
        <span className={styles.floatingHeart1}>💕</span>
        <span className={styles.floatingHeart2}>💕</span>

        <h1 className={styles.title}>ჩემი სიყვარული ხარ</h1>

        <p className={styles.text}>
          გვერდი რომელიც ჩვენი ემოციების საცავი იქნება
        </p>

        {!open ? (
          <button
            className={styles.button}
            onClick={() => setOpen(true)}
            aria-label="გახსენი"
          >
            გახსენი
          </button>
        ) : (
          <>
            {/* TIMER */}
            <section className={styles.timer}>
              <div className={styles.ecgContainer}>
                <svg
                  viewBox="0 0 100 20"
                  className={styles.ecgLine}
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <polyline
                    className={styles.ecgPolyline}
                    points="0,10 10,10 12,5 15,15 20,10 30,10 32,5 35,15 40,10 50,10 52,5 55,15 60,10 70,10 72,5 75,15 80,10 90,10 92,5 95,15 100,10"
                    fill="none"
                    stroke="red"
                    strokeWidth="2"
                    strokeLinecap="round"
                    strokeLinejoin="round"
                  />
                </svg>
              </div>

              <div className={styles.timerGrid}>
                <TimeBox label="დღე" value={time.days} />
                <TimeBox label="საათი" value={time.hours} />
                <TimeBox label="წუთი" value={time.minutes} />
                <TimeBox label="წამი" value={time.seconds} />
              </div>

              <p className={styles.timerDate}>05.11.2025 20:30:00 დან ❤️</p>
            </section>

            {/* MESSAGE */}
            <section className={styles.message}>
              მიყვარხარ ყველაზე და ყველაფერზე მეტად
              <div className={styles.heart}>💗</div>
            </section>

          <button
  className={styles.playButton}
  onClick={() => setShowVideo(true)}
>
  ▶️  ჯერ ჩართე
</button>
{showVideo && (
  <div className={styles.videoWrapper}>
    <iframe
      width="100%"
      height="200"
      src="https://www.youtube.com/embed/adgCj3a_n9E?autoplay=1"
      title="YouTube video player"
      allow="autoplay; encrypted-media"
      allowFullScreen
    ></iframe>
  </div>
)}


            {/* PHOTOS */}
            <section className={styles.photosSection}>
              <h2 className={styles.photosTitle}>ჩვენი მომენტები 📸</h2>

              <div className={styles.photosGrid}>
                {photos.map((photo, index) => (
                  <figure key={index} className={styles.photoCard}>
                    {photo.src ? (
                      <>
                        <img
                          src={`/photos/${photo.src}`}
                          alt={photo.caption}
                          loading="lazy"
                        />
                        <div className={styles.photoOverlay}>
                          <figcaption className={styles.photoCaption}>
                            {photo.caption}
                          </figcaption>
                        </div>
                      </>
                    ) : (
                      <div className={styles.textOnlyCard}>
                        {photo.caption}
                      </div>
                    )}
                  </figure>
                ))}
              </div>
            </section>
          </>
        )}
      </section>
    </main>
  );
}

function TimeBox({ label, value }: { label: string; value: number }) {
  return (
    <div className={styles.timeBox}>
      <span className={styles.timeValue}>{String(value).padStart(2, "0")}</span>
      <span className={styles.timeLabel}>{label}</span>
    </div>
  );
}
